In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'avg_time_diff': {22836: '0 days 00:02:04.810879',
  23533: '0 days 00:03:35.242784',
  45297: '0 days 00:04:02.764130',
  56232: '0 days 00:02:48.427043',
  92306: '0 days 00:00:18.396753'},
 'count': {22836: 1671, 23533: 879, 45297: 859, 56232: 1130, 92306: 7803},
 'ipAddress': {22836: u'178.73.210.51',
  23533: u'185.125.168.216',
  45297: u'45.32.241.181',
  56232: u'77.66.48.87',
  92306: u'90.180.104.16'}})

In [3]:
df['avg_time_diff'] = pd.to_timedelta(df['avg_time_diff'])

In [4]:
df.avg_time_diff.dt.total_seconds()

22836    124.810879
23533    215.242784
45297    242.764130
56232    168.427043
92306     18.396753
Name: avg_time_diff, dtype: float64

In [5]:
data = {'Salary':[1000, 2222, 3321, 4414, 5151],
       'Name': ['Pete', 'Steve',
                   'Brian',
                   'Ryan', 'Jim'],
       'Share':[29.88, 19.05, 8.17,
               7.3, 6.15],
       'Date':['11/24/2020', '12/21/2019', 
               '10/14/2018', '12/13/2017', '01/08/2017'],
       'Date2': [20120902, 20130413, 20140921, 20140321,
                20140321]}
data_pd = pd.DataFrame(data)
data_pd.head()

   Salary   Name  Share        Date     Date2
0    1000   Pete  29.88  11/24/2020  20120902
1    2222  Steve  19.05  12/21/2019  20130413
2    3321  Brian   8.17  10/14/2018  20140921
3    4414   Ryan   7.30  12/13/2017  20140321
4    5151    Jim   6.15  01/08/2017  20140321

In [6]:
print(data_pd.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Salary  5 non-null      int64
 1   Name    5 non-null      object
 2   Share   5 non-null      float64
 3   Date    5 non-null      object
 4   Date2   5 non-null      int64
dtypes: float64(1), int64(2), object(2)
memory usage: 328.0+ bytes
None

In [7]:
data_pd['Date'] = pd.to_datetime(data_pd['Date'])

In [8]:
print(data_pd.head())

   Salary   Name  Share       Date     Date2
0    1000   Pete  29.88 2020-11-24  20120902
1    2222  Steve  19.05 2019-12-21  20130413
2    3321  Brian   8.17 2018-10-14  20140921
3    4414   Ryan   7.30 2017-12-13  20140321
4    5151    Jim   6.15 2017-01-08  20140321

In [9]:
(data_pd.iloc[0].Date - data_pd.iloc[1].Date).total_seconds()

29289600.0